package com.jitong.test;

import com.jitong.common.util.StringUtil;

public class StringTest {
	public static void main(String[] args)throws Exception{
/*		String a="你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好 你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好";
		System.out.println(a.length());
		String b="abcdefgh";
		System.out.println(b.length());*/
		
		
		/*String s = "123456789";
		System.out.println(s.substring(2, 9));*/
		
		String s=StringUtil.md5("Admin");
		System.out.println(s);
		
		System.out.println(Thread.currentThread());
	}
}
